const path = require('path')

const { resolve } = path
const nodeModulesPath = resolve(__dirname, '../../lilac_api/node_modules')
const dotEnvFilePath = resolve(__dirname, '../../lilac_api/.env')

require(`${nodeModulesPath}/dotenv`).config({
  path: dotEnvFilePath,
})

const mongoose = require(resolve(`${nodeModulesPath}/mongoose`))

const { connect } = mongoose
const { connection } = mongoose

const {
  MONGO_USERNAME: USERNAME,
  MONGO_PASSWORD: PASSWORD,
  MONGO_DB_NAME: DB_NAME,
} = process.env

let uri = `mongodb://${USERNAME}:${PASSWORD}`
uri += `@127.0.0.1:27017/${DB_NAME}?authSource=admin`

connect(
  uri,
  {
    useUnifiedTopology: true,
    useNewUrlParser: true,
  },
  (err) => {
    if (err) console.error(err)
  }
)

connection.once('open', async () => {
  console.log('MongoDB database connection established successfully')
  await connection.db.dropDatabase()

  const modelsPath = resolve(__dirname, '../../lilac_api/src/mongoose/models')

  const models = {}

  models.LanguagesModel = require(modelsPath).LanguagesModel
  models.ProductsModel = require(modelsPath).ProductsModel

  const languages = await require('./collections/Languages')({ models })

  console.log('languages', languages)

  /*await models.ProductsModel.create({
    name: 'Nokta Simplex+',
    price: 13156,
    characteristics: [
      ['Призначення', 'Амфібія'],
      ['Країна походження', 'Туреччина'],
      ['VDI', 'Є'],
      ['Живлення', 'АКБ'],
      ['Пінпоінт', 'Є'],
      ['Статичний режим', 'Немає'],
      ['Регулювання гучності', 'Є'],
      ['Тональна ідентифікація', '3-5'],
      ['Балансування грунту', 'Ручна і авто'],
      ['ЖК дисплей', 'Є'],
      ['Дискримінація', 'Є'],
      ['Тип схеми металошукача', 'VLF'],
      ['Робоча частота', '12 кГц'],
      ['Максимальна глибина', 'До 2-х метрів'],
      ['Глибина на монету', '30-35 см'],
    ],
    characteristics_ru: [
      ['Назначение', 'Амфибия'],
      ['Страна происхождения', 'Турция'],
      ['VDI', 'Есть'],
      ['Питание', 'АКБ'],
      ['Пинпоинт', 'Есть'],
      ['Статический режим', 'Нет'],
      ['Регулировка громкости', 'Есть'],
      ['Тональная идентификация', '3-5'],
      ['Балансировка грунта', 'Ручная и авто'],
      ['ЖК дисплей', 'Есть'],
      ['Дискриминация', 'Есть'],
      ['Тип схемы металлоискателя', 'VLF'],
      ['Рабочая частота', '12 кГц'],
      ['Максимальная глубина', 'До 2-х метров'],
      ['Глубина на монету', '30-35 см'],
    ],
    description_uk:
      'Nokta Simplex це перший водонепроникний металошукач (IP68, занурення до 3-х метрів) на ринку, що пропонує надзвичайну глибину і багатофункціональність за доступною ціною. Прилад досить простий для початківців і вражаючий для експертів! SIMPLEX + є першим детектором початкового рівня, який робить якісний пошук для всіх користувачів як на суші так і в воді. Він має автоматичне  та ручне балансування грунту, а також встановлені режими пошуку, в тому числі пляжний режим, які на відміну від конкурентів не є просто масками дискримінації для виключення певних металів, а є дійсно режимами пошуку, що змінюють алгоритм роботи приладу. Даючи змогу більш ефективно працювати в певних ситуаціях. Тобто на "чистих" місцях він працює на глибину, на засмічених територіях він працює на швидкість і точність визначення. Також окремо можна відзначити статичний режим пошуку "всі метали" який показує велику глибину виявлення цілей, і стане в нагоді пошуківцям які працюють по "війні" та тільки по "чорним" металам. Наявність регулювання гучності звуків "чорних" металів, дає змогу зробити пошук комфортнішим не включаючи масок дискримінації, а отже Ви не будете втрачати в глибині виявлення цілей. Робоча частота 12 кГц дозволяє охопити всі типи пошуку з ухилом на середні і дрібні предмети. Для роботи в темний час присутній зовнішній LED-ліхтарик. Металошукач має вбудовані модуль для підключення бездротових навушників (можна придбати опціонально або в комплектації PRO). Також потрібно відзначити можливість оновлення програмного забезпечення (прошивка). З огляду на можливість тривалої роботи, прилад підтримує зарядку від зовнішніх пристроїв типу Powerbank.',
    description_ru:
      'Nokta Simplex – это первый водонепроницаемый металлоискатель (IP68, погружение до 3-х метров) на рынке, предлагающий чрезвычайную глубину и многофункциональность по доступной цене. Прибор достаточно прост для начинающих и впечатляющий для экспертов! SIMPLEX+ является первым детектором начального уровня, который производит качественный поиск для всех пользователей как на суше так и в воде.Он имеет автоматическую и ручную балансировку почвы, а также установленые режимы поиска, в том числе "пляжный" режим, которые в отличие от конкурентов не просто маски дискриминации для исключения определенных металлов, а являются действительно режимами поиска, изменяющими алгоритм работы прибора. Позволяя более эффективно работать в определенных ситуациях. То есть, на "чистых" местах он работает на глубину, на засоренных территориях он работает на скорость и точность определения.Также отдельно можно отметить статический режим поиска "все металлы" показывающий большую глубину обнаружения целей, и пригодится поисковикам работающим по "войне" и только по "черным" металлам. Наличие регулировки громкости звуков "черных" металлов позволяет сделать поиск более комфортным не включая масок дискриминации, а значит Вы не будете терять в глубине обнаружения целей. Рабочая частота 12 кГц позволяет охватить все типы поиска с уклоном на мелкие и средние предметы.Для работы в темное время находится внешний LED-фонарик. Металлоискатель имеет встроенный модуль для подключения беспроводных наушников (можно приобрести опционально или в комплектации PRO). Также следует отметить возможность обновления программного обеспечения (прошивка). Учитывая возможность длительной работы, устройство поддерживает зарядку от внешних устройств типа Powerbank.',
    images: [{ url: '' }],
  })*/

  process.exit(0)
})
